# Використовуємо офіційний образ Golang
FROM golang AS builder

# Встановлюємо робочу директорію в контейнері
WORKDIR /app

# Копіюємо залежності та виконуємо збірку проекту
COPY . .
RUN CGO_ENABLED=0 go build -o server .

# Використовуємо легкий образ для запуску нашого сервера
FROM alpine:latest

# Копіюємо виконуваний файл з попереднього етапу
COPY --from=builder /app/server /server

# Вказуємо, на якому порту буде працювати сервер
EXPOSE 8080

# Запускаємо наш сервер при старті контейнера
CMD ["/server"]
